---
kind: other
id: Methods.T:Autodesk.Revit.UI.TableViewUIUtils
source: html/5db881e6-4904-2712-a1b3-a9917f35e8ef.htm
---
# TableViewUIUtils Methods

Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited.